Repository: qiuyuzhou/ShadowsocksX-NG
Catalog: ShadowsocksX-NG2/App/Rules.xcstrings
Source language: zh_hans
Languages: en

source: 代理规则
en: Proxy Rules

source: 全部规则
en: All Rules

source: 自定义规则
en: Custom Rules

source: 固定本地策略
en: Fixed Local Policy

source: 搜索规则
en: Search Rules

source: 全部行动
en: All Actions

source: 直连
en: Direct

source: 代理
en: Proxy

source: 匹配内容
en: Match

source: 类型
en: Type

source: 行动
en: Action

source: 来源
en: Sources

source: 状态
en: Status

source: 集合不完整
en: Incomplete Collection

source: 没有符合条件的规则
en: No Matching Rules

source: 加载规则…
en: Loading Rules…

source: 刷新
en: Refresh

source: 覆盖详情
en: Coverage Details

source: 被同行动规则覆盖
en: Covered by Same-Action Rules

source: 被相反行动规则遮蔽
en: Shadowed by Opposite-Action Rules

source: 部分重叠
en: Partial Overlap

source: 独立候选
en: Independent Candidate

source: 快照制作时的转换报告
en: Conversion Report at Snapshot Creation

source: 精确域名
en: Exact Domain

source: 域名后缀
en: Domain Suffix

source: 简单主机名
en: Simple Hostname

source: 固定策略优先，以下范围始终直连。
en: Fixed policy takes precedence; these targets always connect directly.

source: 覆盖分析仅描述当前规则集合，不表示运行时已生效。
en: Coverage analysis describes this rule collection; it does not indicate runtime activation.

source: 集合不完整时，覆盖解释仅基于已加载来源。
en: When the collection is incomplete, coverage explanations use only loaded sources.

source: 已转换
en: Converted

source: 已吸收
en: Absorbed

source: 已跳过
en: Skipped

source: 已拒绝
en: Rejected

source: IP 同时命中两种行动时，直连优先。
en: Direct wins when an IP matches both actions.

source: 其他命中规则
en: Other matching rules

source: 决定结果的规则
en: Rules determining the result

source: 固定本地策略优先。
en: Fixed local policy takes precedence.

source: 地址（域名、IP 或 URL）
en: Address (domain, IP or URL)

source: 域名同时命中两种行动时，代理优先。
en: Proxy wins when a domain matches both actions.

source: 显示顺序不代表路由优先级。
en: Display order does not indicate routing priority.

source: 未匹配规则
en: No matching rule

source: 未经 DNS 解析，未测试 IP 规则
en: No DNS lookup was performed; IP rules were not tested.

source: 测试
en: Test

source: 测试中…
en: Testing…

source: 请输入有效的域名、IP 或带主机的 URL。
en: Enter a valid domain, IP or URL with a host.

source: 集合不完整，无法测试地址。
en: The collection is incomplete; address testing is unavailable.

source: 启用
en: Enable

source: 禁用
en: Disable

source: 全部状态
en: All states

source: 已启用
en: Enabled

source: 已禁用
en: Disabled

source: 无当前来源
en: No current source

source: 正在保存并应用…
en: Saving and applying…

source: 恢复失败
en: Recovery failed

source: 已保存
en: Saved

source: 保存失败
en: Save failed

source: 部署失败，已恢复
en: Deployment failed; restored

source: 版本已变化，请刷新后重试
en: Rules changed; refresh and retry

source: 规则文档无效
en: Invalid rule document

source: 正在更新规则…
en: Updating rules…

source: 正在加载规则…
en: Loading rules…

source: 已应用
en: Applied

source: 无需重新应用
en: No runtime update needed

source: 运行规则模式时应用
en: Applies when running in Rules mode

source: 保存失败，规则未更改
en: Couldn't save; rules unchanged

source: 应用失败，已恢复原规则
en: Couldn't apply; previous rules restored

source: 恢复失败，请检查运行状态
en: Recovery failed; check runtime status

source: 运行状态已变化，请检查当前状态
en: Runtime state changed; check current status

source: 规则已变化，请刷新后重试
en: Rules changed; refresh and try again

source: 无法更新规则
en: Couldn't update rules

source: 查看详情
en: View Details

source: 关闭
en: Dismiss

source: 刷新规则
en: Refresh Rules

source: 查看运行状态
en: View Runtime Status

source: 已恢复原规则
en: Previous rules restored

source: 已启用 %lld 条规则
en: Enabled %lld rules

source: 已禁用 %lld 条规则
en: Disabled %lld rules

source: 规则列表未更新，请刷新规则。
en: Couldn't update the rule list. Refresh rules.

source: 请重新执行启用或禁用操作。
en: Try enabling or disabling the rules again.

source: 请刷新规则，重新选择后再操作。
en: Refresh rules, then select the rules again.

source: 请在首页检查当前代理运行状态。
en: Check the current proxy runtime status on Home.

source: 请检查规则数据后再操作。
en: Check the rule data before trying again.

source: 新增规则
en: Add Rule

source: 编辑规则
en: Edit Rule

source: IP 地址
en: IP Address

source: CIDR 范围
en: CIDR Range

source: 规范化预览
en: Normalized Preview

source: 请输入有效的 IPv4 或 IPv6 地址。
en: Enter a valid IPv4 or IPv6 address.

source: 请输入有效的 IPv4 或 IPv6 CIDR 范围。
en: Enter a valid IPv4 or IPv6 CIDR range.

source: 请输入有效的 ASCII 域名；不支持通配符、URL 或路径。
en: Enter a valid ASCII domain; wildcards, URLs, and paths are not supported.

source: 相同匹配条件和行动的自定义规则已存在。
en: A custom rule with the same match and action already exists.

source: 代理规则与固定本地策略冲突，无法保存。
en: This proxy rule conflicts with the fixed local policy and cannot be saved.

source: 将与已有来源合并显示。
en: This rule will appear with its existing sources.

source: 此身份已禁用；保存不会重新启用。
en: This identity is disabled; saving will not enable it.

source: 新身份将继承禁用状态；旧禁用记录保留。
en: The new identity will remain disabled; the previous disabled record will be kept.

source: 覆盖关系仅解释已启用规则之间的关系，不代表当前流量行为。
en: Coverage describes relationships among enabled rules; it does not predict current traffic.

source: 规则集合已变化，请重新打开编辑器。
en: The rule collection has changed. Reopen the editor.

source: 已新增规则
en: Rule added

source: 已编辑规则
en: Rule edited

source: 请重试规则操作。
en: Try the rule operation again.

source: 删除 %lld 条自定义规则…
en: Delete %lld Custom Rules…

source: 删除 %lld 条自定义规则？
en: Delete %lld Custom Rules?

source: 只删除所选自定义条目。其他来源的规则和已有禁用记录将保留。
en: Only the selected custom entries will be deleted. Rules from other sources and existing disablement records will be kept.

source: 删除
en: Delete

source: 已删除 %lld 条自定义规则
en: Deleted %lld Custom Rules

source: 规则集合已变化，请重新确认删除。
en: The rule collection has changed. Confirm the deletion again.
